package org.example;
/*
 1 уровень сложности: 1. У вас есть стол, на который один робот-манипулятор кладет деталь,
 а второй забирает эту деталь.
Когда Робот1 положит деталь на стол, он должен обязательно ждать, пока Робот2 заберет эту деталь
 и только тогда класть следующую. Постройте программу, которая автоматизирует эту работу.
Количество деталей, которые должны обработать манипуляторы, пользователь задает с клавиатуры.
*/

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}