package org.example;

public class Main {
    public static void main(String[] args) {
//        2*. У вас есть задача проверять какой-то сайт, с целью проверки опубликования
//        на нем новой информации, но если мы будем слишком часто проверять этот сайт,
//        то нас могут "забанить" за спам. Чтобы избежать этого, вы должны слать свои запросы
//        не чаще чем один раз в минуту.
//                Ваша задача должна работать параллельно основной функциональности и не занимать ресурсы
//        главного потока.
//        Подумайте, какой механизм Java вы могли бы использовать для автоматизации данной задачи.
//        Как реализацию работы с сайтом, просто выведите сообщение о том, что соединение
//        установлено и выведите текущее время.
//        3*. В одном из предыдущих ДЗ у вас была задача:
//        У вас в магазине распродажа. К вам набежало 10 000 клиентов и вы пытаетесь корректно всех обслужить с
//        учетом того, что одновременно у вас внутри магазина может находиться не более 10 покупателей
//        (согласно карантинным нормам) и время обслуживания одного покупателя занимает 30 секунд.
//                Сымитируйте данный процесс работы и подсчитайте за какой период времени вы сможете обслужить данный
//        объем покупателей?
//        Отдельный покупатель - отдельный поток.
//                Можно было бы реализовать данную задачу не используя семафор?
    }
}