package hw_01_02;
/*

2. У вас есть на почте коробка, у которой есть 3 характеристики: высота, длина и ширина.
В коробку вы можете положить любой объект (главное чтобы он влез по габаритам)
и его отправить по почте или получить по почте.
Как Вы думаете, можем ли мы использовать для создания данного класса Generic подход?
Если да, попробуйте реализовать данный класс.
3. Вы владелей концертного зала со сценой. Вы нанимаете артистов различиного жанра,
которые развлекают зрителей, используя свои таланты. Реализуйте класс Концерт,
в котором разные артисты будут выходить на сцену и развлекать зрителей используя
свои умения и талант. Подумайте, можно для класса Концерт применить Generiс подход
к реализации?
 */

public class Main {
    public static void main(String[] args) {

    }
}